{"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "Masking", "config": {"name": "masking_1", "trainable": true, "batch_input_shape": [null, 70, 20], "dtype": "float32", "mask_value": 0.0}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "batch_input_shape": [null, 70, 20], "dtype": "float32", "layer": {"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "embedding_1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "embedding_1_input"}, "inbound_nodes": []}, {"name": "sequential_1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 20], "dtype": "float32", "input_dim": 137, "output_dim": 60, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 20}}]}, "inbound_nodes": [[["embedding_1_input", 0, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 60], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "filters": 50, "kernel_size": [1], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 100, "kernel_size": [2], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "filters": 150, "kernel_size": [3], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "filters": 200, "kernel_size": [4], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "filters": 200, "kernel_size": [5], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_6", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "filters": 200, "kernel_size": [6], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_7", "class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "filters": 200, "kernel_size": [7], "strides": [1], "padding": "causal", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv1d_1", 0, 0], ["conv1d_2", 0, 0], ["conv1d_3", 0, 0], ["conv1d_4", 0, 0], ["conv1d_5", 0, 0], ["conv1d_6", 0, 0], ["conv1d_7", 0, 0]]}, "inbound_nodes": [[["sequential_1", 1, 0, {}]]]}, {"name": "model_2", "class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 50], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 100], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 150], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "global_max_pooling1d_1", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "global_max_pooling1d_2", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_2", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "global_max_pooling1d_3", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_3", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "global_max_pooling1d_4", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_4", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "global_max_pooling1d_5", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_5", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "global_max_pooling1d_6", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_6", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "global_max_pooling1d_7", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_7", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}], ["global_max_pooling1d_2", 0, 0, {}], ["global_max_pooling1d_3", 0, 0, {}], ["global_max_pooling1d_4", 0, 0, {}], ["global_max_pooling1d_5", 0, 0, {}], ["global_max_pooling1d_6", 0, 0, {}], ["global_max_pooling1d_7", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0], ["input_8", 0, 0]], "output_layers": [["concatenate_1", 0, 0]]}, "inbound_nodes": [[["model_1", 1, 0, {}], ["model_1", 1, 1, {}], ["model_1", 1, 2, {}], ["model_1", 1, 3, {}], ["model_1", 1, 4, {}], ["model_1", 1, 5, {}], ["model_1", 1, 6, {}]]]}, {"name": "model_3", "class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1100], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1100, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAABkAXwAGABTACkCTukBAAAAqQApAVoNbmV0d29ya19p\nbnB1dHICAAAAcgIAAAD6Ly9ob21lL3ByaW1vei93b3Jrc3BhY2UvU2xvVGFnZ2VyL25ldXJhbG1v\nZGVsLnB52gg8bGFtYmRhPkkAAADzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["input_9", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["multiply_1", 0, 0, {}], ["multiply_2", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["add_1", 0, 0]]}, "inbound_nodes": [[["model_2", 1, 0, {}]]]}], "input_layers": [["embedding_1_input", 0, 0]], "output_layers": [["model_3", 1, 0]]}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 900, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 900, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 118, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}