{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "trainable": true, "batch_input_shape": [null, 70, 20], "dtype": "float32", "mask_value": 0.0}}, {"class_name": "TimeDistributed", "config": {"name": "SequenceFeatureExtract", "trainable": true, "batch_input_shape": [null, 70, 20], "dtype": "float32", "layer": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Embeddings_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "Embeddings_input"}, "inbound_nodes": []}, {"name": "Embeddings", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "Embeddings", "trainable": true, "batch_input_shape": [null, 20], "dtype": "float32", "input_dim": 137, "output_dim": 60, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 20}}], "inbound_nodes": [[["Embeddings_input", 0, 0, {}]]]}, {"name": "Convolutional", "class_name": "Model", "config": {"name": "Convolutional", "layers": [{"name": "InputFromEmbeddings", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 60], "dtype": "float32", "sparse": false, "name": "InputFromEmbeddings"}, "inbound_nodes": []}, {"name": "Conv1D_50_1", "class_name": "Conv1D", "config": {"name": "Conv1D_50_1", "trainable": true, "filters": 50, "kernel_size": [1], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["InputFromEmbeddings", 0, 0, {}]]]}, {"name": "Conv1D_100_2", "class_name": "Conv1D", "config": {"name": "Conv1D_100_2", "trainable": true, "filters": 100, "kernel_size": [2], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["InputFromEmbeddings", 0, 0, {}]]]}, {"name": "Conv1D_150_3", "class_name": "Conv1D", "config": {"name": "Conv1D_150_3", "trainable": true, "filters": 150, "kernel_size": [3], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["InputFromEmbeddings", 0, 0, {}]]]}, {"name": "Conv1D_200_4", "class_name": "Conv1D", "config": {"name": "Conv1D_200_4", "trainable": true, "filters": 200, "kernel_size": [4], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["InputFromEmbeddings", 0, 0, {}]]]}, {"name": "Conv1D_200_5", "class_name": "Conv1D", "config": {"name": "Conv1D_200_5", "trainable": true, "filters": 200, "kernel_size": [5], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["InputFromEmbeddings", 0, 0, {}]]]}, {"name": "Conv1D_200_6", "class_name": "Conv1D", "config": {"name": "Conv1D_200_6", "trainable": true, "filters": 200, "kernel_size": [6], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["InputFromEmbeddings", 0, 0, {}]]]}, {"name": "Conv1D_200_7", "class_name": "Conv1D", "config": {"name": "Conv1D_200_7", "trainable": true, "filters": 200, "kernel_size": [7], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["InputFromEmbeddings", 0, 0, {}]]]}], "input_layers": [["InputFromEmbeddings", 0, 0]], "output_layers": [["Conv1D_50_1", 0, 0], ["Conv1D_100_2", 0, 0], ["Conv1D_150_3", 0, 0], ["Conv1D_200_4", 0, 0], ["Conv1D_200_5", 0, 0], ["Conv1D_200_6", 0, 0], ["Conv1D_200_7", 0, 0]]}, "inbound_nodes": [[["Embeddings", 1, 0, {}]]]}, {"name": "MaxPoolingOverTime", "class_name": "Model", "config": {"name": "MaxPoolingOverTime", "layers": [{"name": "FromConvolutional_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 50], "dtype": "float32", "sparse": false, "name": "FromConvolutional_0"}, "inbound_nodes": []}, {"name": "FromConvolutional_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 100], "dtype": "float32", "sparse": false, "name": "FromConvolutional_1"}, "inbound_nodes": []}, {"name": "FromConvolutional_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 150], "dtype": "float32", "sparse": false, "name": "FromConvolutional_2"}, "inbound_nodes": []}, {"name": "FromConvolutional_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "FromConvolutional_3"}, "inbound_nodes": []}, {"name": "FromConvolutional_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "FromConvolutional_4"}, "inbound_nodes": []}, {"name": "FromConvolutional_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "FromConvolutional_5"}, "inbound_nodes": []}, {"name": "FromConvolutional_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 200], "dtype": "float32", "sparse": false, "name": "FromConvolutional_6"}, "inbound_nodes": []}, {"name": "MaxPoolingOverTime_0", "class_name": "GlobalMaxPooling1D", "config": {"name": "MaxPoolingOverTime_0", "trainable": true}, "inbound_nodes": [[["FromConvolutional_0", 0, 0, {}]]]}, {"name": "MaxPoolingOverTime_1", "class_name": "GlobalMaxPooling1D", "config": {"name": "MaxPoolingOverTime_1", "trainable": true}, "inbound_nodes": [[["FromConvolutional_1", 0, 0, {}]]]}, {"name": "MaxPoolingOverTime_2", "class_name": "GlobalMaxPooling1D", "config": {"name": "MaxPoolingOverTime_2", "trainable": true}, "inbound_nodes": [[["FromConvolutional_2", 0, 0, {}]]]}, {"name": "MaxPoolingOverTime_3", "class_name": "GlobalMaxPooling1D", "config": {"name": "MaxPoolingOverTime_3", "trainable": true}, "inbound_nodes": [[["FromConvolutional_3", 0, 0, {}]]]}, {"name": "MaxPoolingOverTime_4", "class_name": "GlobalMaxPooling1D", "config": {"name": "MaxPoolingOverTime_4", "trainable": true}, "inbound_nodes": [[["FromConvolutional_4", 0, 0, {}]]]}, {"name": "MaxPoolingOverTime_5", "class_name": "GlobalMaxPooling1D", "config": {"name": "MaxPoolingOverTime_5", "trainable": true}, "inbound_nodes": [[["FromConvolutional_5", 0, 0, {}]]]}, {"name": "MaxPoolingOverTime_6", "class_name": "GlobalMaxPooling1D", "config": {"name": "MaxPoolingOverTime_6", "trainable": true}, "inbound_nodes": [[["FromConvolutional_6", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["MaxPoolingOverTime_0", 0, 0, {}], ["MaxPoolingOverTime_1", 0, 0, {}], ["MaxPoolingOverTime_2", 0, 0, {}], ["MaxPoolingOverTime_3", 0, 0, {}], ["MaxPoolingOverTime_4", 0, 0, {}], ["MaxPoolingOverTime_5", 0, 0, {}], ["MaxPoolingOverTime_6", 0, 0, {}]]]}], "input_layers": [["FromConvolutional_0", 0, 0], ["FromConvolutional_1", 0, 0], ["FromConvolutional_2", 0, 0], ["FromConvolutional_3", 0, 0], ["FromConvolutional_4", 0, 0], ["FromConvolutional_5", 0, 0], ["FromConvolutional_6", 0, 0]], "output_layers": [["concatenate_1", 0, 0]]}, "inbound_nodes": [[["Convolutional", 1, 0, {}], ["Convolutional", 1, 1, {}], ["Convolutional", 1, 2, {}], ["Convolutional", 1, 3, {}], ["Convolutional", 1, 4, {}], ["Convolutional", 1, 5, {}], ["Convolutional", 1, 6, {}]]]}, {"name": "Highway", "class_name": "Model", "config": {"name": "Highway", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1100], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "transorm_gate", "class_name": "Dense", "config": {"name": "transorm_gate", "trainable": true, "units": 1100, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "carry_gate", "class_name": "Lambda", "config": {"name": "carry_gate", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAABkAXwAGABTACkCTukBAAAAqQApAdoBeHICAAAAcgIA\nAAD6HzxpcHl0aG9uLWlucHV0LTIyLTJiYTZhNTc5NDc5Yz7aCDxsYW1iZGE+CgAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["transorm_gate", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["transorm_gate", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["carry_gate", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["multiply_1", 0, 0, {}], ["multiply_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["add_1", 0, 0]]}, "inbound_nodes": [[["MaxPoolingOverTime", 1, 0, {}]]]}], "input_layers": [["Embeddings_input", 0, 0]], "output_layers": [["Highway", 1, 0]]}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "RNN1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 900, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "RNN2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 900, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 118, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}], "keras_version": "2.1.5", "backend": "tensorflow"}